In [ ]:
# 4. Indexing and Selection
import pandas as pd
data = pd.DataFrame({
'Park': ['A', 'A', 'B', 'B'],
'Name': ['Anna','Ben','Chris','Daisy'],
'Lemonades': [2, 3, 4, 5]
})
data.set_index("Name",inplace=True) #set_index() works with columns
data

      Park  Lemonades
Name
Anna     A          2
Ben      A          3
Chris    B          4
Daisy    B          5

In [ ]:
multi_data = pd.DataFrame({
'Park': ['A', 'A', 'B', 'B'],
'Name': ['Anna','Ben','Chris','Daisy'],
'Lemonades': [2, 3, 4, 5]
}).set_index(['Park', 'Name'])
multi_data #multi-index

            Lemonades
Park Name
A    Anna           2
     Ben            3
B    Chris          4
     Daisy          5

In [ ]:
# Selecting with Conditions
data[data["Lemonades"]>2]

In [15]:
# Query Method
data.query("Park=='A'")

Empty DataFrame
Columns: []
Index: [(A, 2), (A, 3)]

In [7]:
#  Working with Data
import pandas as pd
df=pd.read_csv("C:/Users/anshu/Downloads/selection list it/csv/CWC2023.csv")
df=df.iloc[:6,:5]
df

,Match ID,Match Date,Match Time,City,Stadium
0,1,05-10-2023,2:00 PM,Ahmedabad,Narendra Modi Stadium
1,2,06-10-2023,2:00 PM,Hyderabad,Eden Gardens
2,3,07-10-2023,2:00 PM,Dharamshala,HPCA Stadium
3,4,07-10-2023,2:00 PM,Delhi,Arun Jaitley Stadium
4,5,08-10-2023,2:00 PM,Chennai,M. A. Chidambaram Stadium
5,6,09-10-2023,2:00 PM,Hyderabad,Rajiv Gandhi International Stadium

In [13]:
import numpy as np
d = {'x': [1, 2, 3], 'y': np.array([10, 20, 30]), 'z': 50}
dd=pd.DataFrame(d)

In [14]:
dd.to_csv("dd.csv")

In [15]:
pd.read_csv("dd.csv")

   Unnamed: 0  x   y   z
0           0  1  10  50
1           1  2  20  50
2           2  3  30  50

In [41]:
listt = [[1, 2, np.nan,4,5], [2, np.nan, 100,6,7], [3, 8,0,65, 100],[32, 81,0,7, 100]]
d=pd.DataFrame(listt, columns=["a","b","c","d","e"])

In [38]:
narr=np.array(listt)
pd.DataFrame(narr, columns=["a","b","c","d","e"]) # one thing to note that lidt in lidt or row in array is treated as row in dataframe

      a     b      c    d      e
0   1.0   2.0    NaN  4.0    5.0
1   2.0   NaN  100.0  6.0    7.0
2   3.0   8.0    0.0  NaN  100.0
3  32.0  81.0    0.0  NaN  100.0

In [42]:
# Data Cleaning and Preprocessing
d

    a     b      c   d    e
0   1   2.0    NaN   4    5
1   2   NaN  100.0   6    7
2   3   8.0    0.0  65  100
3  32  81.0    0.0   7  100

In [43]:
d.dropna()

    a     b    c   d    e
2   3   8.0  0.0  65  100
3  32  81.0  0.0   7  100

In [44]:
d.fillna(5)

    a     b      c   d    e
0   1   2.0    5.0   4    5
1   2   5.0  100.0   6    7
2   3   8.0    0.0  65  100
3  32  81.0    0.0   7  100

In [46]:
d.isnull()

       a      b      c      d      e
0  False  False   True  False  False
1  False   True  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False

In [57]:
listt = [[1, 2, np.nan,4,5], [2, np.nan, 100,6,7], [3, 8,0,65, 100],[32, 81,0,7, 100],[3, 8,0,65, 100],[1, 2, np.nan,4,5]]
g=pd.DataFrame(listt, columns=[" a","b","c","d","e"])
g

    a     b      c   d    e
0   1   2.0    NaN   4    5
1   2   NaN  100.0   6    7
2   3   8.0    0.0  65  100
3  32  81.0    0.0   7  100
4   3   8.0    0.0  65  100
5   1   2.0    NaN   4    5

In [48]:
# Remove Duplicates
g.drop_duplicates()

    a     b      c   d    e
0   1   2.0    NaN   4    5
1   2   NaN  100.0   6    7
2   3   8.0    0.0  65  100
3  32  81.0    0.0   7  100

In [ ]:
# Replace Values
g[" a"]=g[" a"].replace(1,259)

     a     b      c   d    e
0  259   2.0    NaN   4    5
1    2   NaN  100.0   6    7
2    3   8.0    0.0  65  100
3   32  81.0    0.0   7  100
4    3   8.0    0.0  65  100
5  259   2.0    NaN   4    5

In [62]:
g.replace(np.nan,0,inplace=True)
g

     a     b      c   d    e
0  259   2.0    0.0   4    5
1    2   0.0  100.0   6    7
2    3   8.0    0.0  65  100
3   32  81.0    0.0   7  100
4    3   8.0    0.0  65  100
5  259   2.0    0.0   4    5

In [63]:
# Type Conversion
g['c']=g['c'].astype(int)
g

     a     b    c   d    e
0  259   2.0    0   4    5
1    2   0.0  100   6    7
2    3   8.0    0  65  100
3   32  81.0    0   7  100
4    3   8.0    0  65  100
5  259   2.0    0   4    5